print('Welcome, в цій грій ти будеш в ролі собаки і будеш сам вирішувати свою долю!')
print("В цій грі в тебе завжди буде вибір, і різні гілки твоєї долі, все залежить від тебе!")
print("Основне правило гри полягаю в тому щоб давати відповіді тільки цифрою.")
print("Я буду давати тобі вибір, твоя задача відповідати тільки цифрою, у іншому випадку гра буде закінчина і ти програєш.")
print("Тепер ти ознайомлений з смислом гри, а також і з правилом, добавлю ще те що ім'я ти вибираєш сам і можеш використовувати літери. ")
print("Зараз у тебе два завдання, а іменно це створити свого персонажа(вибір клички, породи, кольору шерсті,власника), а друге це провести свій перший день в новому будинку, думай над своїм вибором щоб не пошкодити вибраній ролі(собаці) у противному випадку твоя гра буде закінчина.")
print("Тож розпочнему будувати нашу долю щасливої собаки!")
name = input("Введіть ім'я яким тебе будуть називати: ")
print("Чудове ім'я " + name + " надалі тебе чекає вибір кольору шерсті, тут думай добре!")
print(" БІЛА ШЕРСТЬ - 1")
print(" ЧОРНА ШЕРСТЬ - 2")
print(" Рижа шерсть - 3")
sherst = input("Введіть обраний варіант - ")
sherst = int(sherst)
if sherst == 1:
    print("Чудовий вибір, надалі твоя шерсть буде білою!")
elif sherst == 2:
    print("Ну не такий чудовий вибір, але що маємо то маємо надалі ти будеш ЧОРНИЙ! ")
elif sherst == 3:
    print("Це не поганий вибір, надалі твоя шерсть буде рижого кольру, цей кольор доречі люблять багато людей!")
else:
    print("Я ж просив виконувати правила гри!!! Тобі потрібно вибрати цифру із запропонованих! Надалі будь уважнішим, спробуй спочатку...")
    exit()
print(" Далі давай вибиремо твою породу: ")
print(" французький бульдог - 1")
print(" хаски - 2")
print(" бігль - 3")
print(" Лабрадор-ретривер - 4")
poroda = input("Введіть цифру, тієї породи яку бажаєте: ")
poroda = int(poroda)
if poroda == 1:
    print(" Ти вибрав породу французький бульдок тепер ти маленька і уродлива собачка.) ")
    if poroda == 1:
        poroda = "Французький бульдог"
    print("Ітак тепер ти " + poroda + " якого звати " + name)
elif poroda == 2:
    print(" Ти вибрав породу 'хаски' тепер ти будеш завжди вити і дратувати всіх навкруги)")
    if poroda == 2:
        poroda = "Хаски"
    print("Ітак тепер ти " + poroda + " якого звати " + name)
elif poroda == 3:
    print("Ти вибрав породу 'бігль' в тебе будуть великі вуха, які усі будуть любити.")
    if poroda == 3:
        poroda = "Бігль"
    print("Ітак тепер ти " + poroda + " якого звати " + name)
elif poroda == 4:
    print("Ти вибрав породу 'лабладор' ти найкраща собака у світі яку всю люблять! ")
    if poroda == 4:
        poroda = "Лабладор"
    print("Ітак тепер ти " + poroda + " якого звати " + name)
# у мене просто тоже лабладор, хаххахах
else:
    print("Ти що, я ж просив тебе вибирати цифри коректно, будь уважніший і почти спочатку...")
    exit()
print("Ітак надалі тобі потрібно вибрати свого власника, тобто того хто буде за тобою наглядати:")
print(" Якщо хочеш щоб твій власник був Windows вибири цифру - 1 ")
print(" Якщо хочеш щоб твій власник був Linux вибири цифру - 2 ")
print(" Якщо хочеш щоб твій власник був macOS вибири цифру - 3 ")
v1 = input("Введіть ту цифру яка відповідає вашій думці про вибір свого власника який буде за вами наглядати:")
v1 = int(v1)
if v1 == 1:#для віндовса(для всіх трох операційних одинаково просто міняється власник і чуть чуть міняється текст)
    print("Ітак твій власник це Windows, тож тепер ти завжди повинен його слухати та поважати його!")
    print("Історія починається... Тебе забрали від матері і привезли у твій новий дім містера Windows, це дуже розумний персонаж і він уміє читати твої думки, тож вибири що ти хочеш поїсти!")
    print("Каша - 1 ")
    print ("Молоко - 2 ")
    print ("Зїсти свого власника - 3 ")
    eat = input("Вибири бажаний варіант: ")
    eat = int(eat)
    if eat == 1: #каша ідеально і багато віток далі
        print("Це самий хороший вибір, тобі дали кашу якою ти підкріпився і твоє почуття дуже хороше!")
        print("Ітак тож якщо ти зробив найкращий вибір із запропонованих, ти можеш весело провести час і більш ефективто пізнавати світ")
        print(" Піти гуляти - 1 ")
        print(" Погратися на подвірЇ будинку свого власника - 2 ")
        print(" Поспати - 3 ")
        print(" Поїсти ще - 4")
        nexttime = input("Введіть ту цифру яка відповідає вашій думці про вибір того як ви проведете надалі свій час: ")
        nexttime = int(nexttime)
        if nexttime == 1: #гуляти
            print("Чудовий вибір,але не найркащий. Твій власник читає твоЇ думки тож ви пішли гуляти, тепер твоя задача вибрати куди ви підете гуляти: ")
            print("До глибокого каньйона - 1")
            print("До глибокого озера - 2")
            print("В безпечний парк - 3")
            go = input("Введіть цифру куди саме ви хочете піти гуляти:")
            go = int(go)
            if go == 1:
                print("Ви пішли гуляти до глибокого каньйона через свою любопитність ти туди упав, твоя гра була закінчина і ти програв!")
                exit()
            elif go == 2:
                print("Ви пішли гуляти до глибокого озера, де ти через свою любопитність упав і втопився, твоя гра була закінчина ТИ ПРОГРАВ!")
                exit()
            elif go == 3:
                print("Ти пішов гуляти до безпечного парку, це був самий правельний варіант, вітаю ти переміг і твій перший день пройшов майже ідеально, все таки тобі потрібно було вибрати варіант погратись на подвірЇ так як ти ще маленький і тобі люба нова тереторія це небезпека! Але ти виграв, хочеш крашще? пройди гру ще раз!")
                exit()
            else:
                print("Ти що, я ж просив тебе вибирати цифри коректно, будь уважніший і почти спочатку")   
                exit()  
        elif nexttime == 2: #гратися
            print("Вітаю це самий найращий варіант у твоєму випадку, ти ще цуциня і гуляти тобі дуже опасно, далі тебе чекає вибір як саме ти будеш гратися. ")
            print("Сам з маленьким мячиком - 1")
            print("Твій власник буде кидати тобі маленький мячик - 2")
            print("Будеш гратись сам із великою злою собакою - 3")
            game = input("Як саме ви хочете погратись?:")
            game = int(game)
            if game == 1:
                print("Не ідеально звичайно, але це не погано, маленьки мячик тобі не пошкодить, ти виграв! Якщо хочеш кращого варіанту пробуй ще раз!")
                exit()
            elif game == 2:
                print("ВІТАЮ ти обрав найркащий варіант, так ти познайомишся із своїм власником ще більше! ТИ ВИГРАВ !!!! ВІТАЮ!!!!!")
                exit()
            elif game == 3:
                print("Ого тебе зїла велика зла собка ти програв!")
                exit()
        elif nexttime == 3: #спати
            print("Це дуже хороший варіант, але я тебе розумію, ти гарно поїв і тобі хочеться відпочити. Твоя енергія закінчилась і на цьому твій перший день буде закінчино, далі тебе чекає більше! Вітаю ти виграв!(вітак може бути більшою, можеш пройти ще раз)")
            exit()
            #важко уже думати хочу спати)) там ще раза треба дописати багато віток, я зробив спочатку форумування так скажемо персонажа(собаки) а потім різні вітки по яким пересувається гравець і кожна вітка має різне значення і веде до ще більшого розгалуження, і різного кінці.
        elif nexttime == 4: #поїсти
            print("Ти вже переїв і тобі дуже погано, твій перший день закінчився ПОГАНО, ти програв!")
            exit()
        else:
            print("Ти що, я ж просив тебе вибирати цифри коректно, будь уважніший і почти спочатку...")
            exit()
    elif eat == 2: #молоко не ідеально, але можна ще виправити
        print("Це не дуже хороший вибір, ти випив молоко і твоє почуття не дуже хороше, але терпиме так як для щенят звичайне молоко не найкраща Їжа, але все ж таки ти можеш продовжувати.")
        print("Саме найраще це було зїсти кашу, але вже що маємо то маємо, через те що ти зробив не ідеальний вибір в тебе буде мало варіантів продовження. ")
        print("Лягти спати - 1.")
        print("Подумати про таблетку - 2.")
        t2 = input("Тебе болить живіт вибири наступну цифру:")
        t2 = int(t2)
        if t2 == 1:
            print("Ти вибрав варіант поспати, ти ляг спати і під час сну тобі стало дуже погано, твій перший день пройшов погано! Ти програв!  ")
            exit()
        elif t2 == 2:
            print("Ти подумав про таблетку, а як ти уже знаєш твій власник читає думки, він дав тобі таблетку і ти пішов спати, так це не ідеальний кінець дня, з задачою ти справився не дуже, але для першого дня я тобі зарахую як виграш!")
            exit()
    elif eat == 3: # моментальний програш
        print("О ні... Що ти накоїв ти попробув покінчити із своїм власником,але твоїх сил було не достатньо і тебе віддали в приют для собак, твоя гра закінчина...")
        exit()
    else:
        print("Ти порушив правила гри, твоя гра закінчина! Надаль будь уважнішим... Попробуй почати спочатку.")
        exit()
        
if v1 == 2: #для лінукса(для всіх трох операційних одинаково просто міняється власник і чуть чуть міняється текст)
    print("Ітак твій власник це Linux, тож тепер ти завжди повинен його слухати та поважати його!")
    print("Історія починається... Тебе забрали від матері і привезли у твій новий дім містера Linux, це дуже розумний персонаж і він уміє читати твої думки, тож вибири що ти хочеш поїсти!")
    print("Каша - 1 ")
    print (" Молоко - 2 ")
    print ("Зїсти свого власника - 3 ")
    eat = input("Вибири бажаний варіант: ")
    eat = int(eat)
    if eat == 1: #каша ідеально і багато віток далі
        print("Це самий хороший вибір, тобі дали кашу якою ти підкріпився і твоє почуття дуже хороше!")
        print("Ітак тож якщо ти зробив найкращий вибір із запропонованих, ти можеш весело провести час і більш ефективто пізнавати світ")
        print(" Піти гуляти - 1 ")
        print(" Погратися на подвірЇ будинку свого власника - 2 ")
        print(" Поспати - 3 ")
        print(" Поїсти ще - 4")
        nexttime = input("Введіть ту цифру яка відповідає вашій думці про вибір того як ви проведете надалі свій час: ")
        nexttime = int(nexttime)
        if nexttime == 1: #гуляти
            print("Чудовий вибір,але не найркащий. Твій власник читає твоЇ думки тож ви пішли гуляти, тепер твоя задача вибрати куди ви підете гуляти: ")
            print("До глибокого каньйона - 1")
            print("До глибокого озера - 2")
            print("В безпечний парк - 3")
            go = input("Введіть цифру куди саме ви хочете піти гуляти:")
            go = int(go)
            if go == 1:
                print("Ви пішли гуляти до глибокого каньйона через свою любопитність ти туди упав, твоя гра була закінчина і ти програв!")
                exit()
            elif go == 2:
                print("Ви пішли гуляти до глибокого озера, де ти через свою любопитність упав і втопився, твоя гра була закінчина ТИ ПРОГРАВ!")
                exit()
            elif go == 3:
                print("Ти пішов гуляти до безпечного парку, це був самий правельний варіант, вітаю ти переміг і твій перший день пройшов майже ідеально, все таки тобі потрібно було вибрати варіант погратись на подвірЇ так як ти ще маленький і тобі люба нова тереторія це небезпека! Але ти виграв, хочеш крашще? пройди гру ще раз!")
                exit()
            else:
                print("Ти що, я ж просив тебе вибирати цифри коректно, будь уважніший і почти спочатку")   
                exit()  
        elif nexttime == 2: #гратися
            print("Вітаю це самий найращий варіант у твоєму випадку, ти ще цуциня і гуляти тобі дуже опасно, далі тебе чекає вибір як саме ти будеш гратися. ")
            print("Сам з маленьким мячиком - 1")
            print("Твій власник буде кидати тобі маленький мячик - 2")
            print("Будеш гратись сам із великою злою собакою - 3")
            game = input("Як саме ви хочете погратись?:")
            game = int(game)
            if game == 1:
                print("Не ідеально звичайно, але це не погано, маленьки мячик тобі не пошкодить, ти виграв! Якщо хочеш кращого варіанту пробуй ще раз!")
                exit()
            elif game == 2:
                print("ВІТАЮ ти обрав найркащий варіант, так ти познайомишся із своїм власником ще більше! ТИ ВИГРАВ !!!! ВІТАЮ!!!!!")
                exit()
            elif game == 3:
                print("Ого тебе зїла велика зла собка ти програв!")
                exit()
        elif nexttime == 3: #спати
            print("Це дуже хороший варіант, але я тебе розумію, ти гарно поїв і тобі хочеться відпочити. Твоя енергія закінчилась і на цьому твій перший день буде закінчино, далі тебе чекає більше! Вітаю ти виграв!(вітак може бути більшою, можеш пройти ще раз)")
            exit()
            #важко уже думати хочу спати)) там ще раза треба дописати багато віток, я зробив спочатку форумування так скажемо персонажа(собаки) а потім різні вітки по яким пересувається гравець і кожна вітка має різне значення і веде до ще більшого розгалуження, і різного кінці.
        elif nexttime == 4: #поїсти
            print("Ти вже переїв і тобі дуже погано, твій перший день закінчився ПОГАНО, ти програв!")
            exit()
        else:
            print("Ти що, я ж просив тебе вибирати цифри коректно, будь уважніший і почти спочатку...")
            exit()
    elif eat == 2: #молоко не ідеально, але можна ще виправити
        print("Це не дуже хороший вибір, ти випив молоко і твоє почуття не дуже хороше, але терпиме так як для щенят звичайне молоко не найкраща Їжа, але все ж таки ти можеш продовжувати.")
        print("Саме найраще це було зїсти кашу, але вже що маємо то маємо, через те що ти зробив не ідеальний вибір в тебе буде мало варіантів продовження. ")
        print("Лягти спати - 1.")
        print("Подумати про таблетку - 2.")
        t2 = input("Тебе болить живіт вибири наступну цифру:")
        t2 = int(t2)
        if t2 == 1:
            print("Ти вибрав варіант поспати, ти ляг спати і під час сну тобі стало дуже погано, твій перший день пройшов погано! Ти програв!  ")
            exit()
        elif t2 == 2:
            print("Ти подумав про таблетку, а як ти уже знаєш твій власник читає думки, він дав тобі таблетку і ти пішов спати, так це не ідеальний кінець дня, з задачою ти справився не дуже, але для першого дня я тобі зарахую як виграш!")
            exit()
    elif eat == 3: # моментальний програш
        print("О ні... Що ти накоїв ти попробув покінчити із своїм власником,але твоїх сил було не достатньо і тебе віддали в приют для собак, твоя гра закінчина...")
        exit()
    else:
        print("Ти порушив правила гри, твоя гра закінчина! Надаль будь уважнішим... Попробуй почати спочатку.")
        exit()
   
if v1 == 3: #для макос(для всіх трох операційних одинаково просто міняється власник і чуть чуть міняється текст)
    print("Ітак твій власник це macOS, тож тепер ти завжди повинен його слухати та поважати його!")
    print("Історія починається... Тебе забрали від матері і привезли у твій новий дім містера macOS, це дуже розумний персонаж і він уміє читати твої думки, тож вибири що ти хочеш поїсти!")
    print("Каша - 1 ")
    print (" Молоко - 2 ")
    print ("Зїсти свого власника - 3 ")
    eat = input("Вибири бажаний варіант: ")
    eat = int(eat)
    if eat == 1: #каша ідеально і багато віток далі
        print("Це самий хороший вибір, тобі дали кашу якою ти підкріпився і твоє почуття дуже хороше!")
        print("Ітак тож якщо ти зробив найкращий вибір із запропонованих, ти можеш весело провести час і більш ефективто пізнавати світ")
        print(" Піти гуляти - 1 ")
        print(" Погратися на подвірЇ будинку свого власника - 2 ")
        print(" Поспати - 3 ")
        print(" Поїсти ще - 4")
        nexttime = input("Введіть ту цифру яка відповідає вашій думці про вибір того як ви проведете надалі свій час: ")
        nexttime = int(nexttime)
        if nexttime == 1: #гуляти
            print("Чудовий вибір,але не найркащий. Твій власник читає твоЇ думки тож ви пішли гуляти, тепер твоя задача вибрати куди ви підете гуляти: ")
            print("До глибокого каньйона - 1")
            print("До глибокого озера - 2")
            print("В безпечний парк - 3")
            go = input("Введіть цифру куди саме ви хочете піти гуляти:")
            go = int(go)
            if go == 1:
                print("Ви пішли гуляти до глибокого каньйона через свою любопитність ти туди упав, твоя гра була закінчина і ти програв!")
                exit()
            elif go == 2:
                print("Ви пішли гуляти до глибокого озера, де ти через свою любопитність упав і втопився, твоя гра була закінчина ТИ ПРОГРАВ!")
                exit()
            elif go == 3:
                print("Ти пішов гуляти до безпечного парку, це був самий правельний варіант, вітаю ти переміг і твій перший день пройшов майже ідеально, все таки тобі потрібно було вибрати варіант погратись на подвірЇ так як ти ще маленький і тобі люба нова тереторія це небезпека! Але ти виграв, хочеш крашще? пройди гру ще раз!")
                exit()
            else:
                print("Ти що, я ж просив тебе вибирати цифри коректно, будь уважніший і почти спочатку")   
                exit()  
        elif nexttime == 2: #гратися
            print("Вітаю це самий найращий варіант у твоєму випадку, ти ще цуциня і гуляти тобі дуже опасно, далі тебе чекає вибір як саме ти будеш гратися. ")
            print("Сам з маленьким мячиком - 1")
            print("Твій власник буде кидати тобі маленький мячик - 2")
            print("Будеш гратись сам із великою злою собакою - 3")
            game = input("Як саме ви хочете погратись?:")
            game = int(game)
            if game == 1:
                print("Не ідеально звичайно, але це не погано, маленьки мячик тобі не пошкодить, ти виграв! Якщо хочеш кращого варіанту пробуй ще раз!")
                exit()
            elif game == 2:
                print("ВІТАЮ ти обрав найркащий варіант, так ти познайомишся із своїм власником ще більше! ТИ ВИГРАВ !!!! ВІТАЮ!!!!!")
                exit()
            elif game == 3:
                print("Ого тебе зїла велика зла собка ти програв!")
                exit()
        elif nexttime == 3: #спати
            print("Це дуже хороший варіант, але я тебе розумію, ти гарно поїв і тобі хочеться відпочити. Твоя енергія закінчилась і на цьому твій перший день буде закінчино, далі тебе чекає більше! Вітаю ти виграв!(вітак може бути більшою, можеш пройти ще раз)")
            exit()
            #важко уже думати хочу спати)) там ще раза треба дописати багато віток, я зробив спочатку форумування так скажемо персонажа(собаки) а потім різні вітки по яким пересувається гравець і кожна вітка має різне значення і веде до ще більшого розгалуження, і різного кінці.
        elif nexttime == 4: #поїсти
            print("Ти вже переїв і тобі дуже погано, твій перший день закінчився ПОГАНО, ти програв!")
            exit()
        else:
            print("Ти що, я ж просив тебе вибирати цифри коректно, будь уважніший і почти спочатку...")
            exit()
    elif eat == 2: #молоко не ідеально, але можна ще виправити
        print("Це не дуже хороший вибір, ти випив молоко і твоє почуття не дуже хороше, але терпиме так як для щенят звичайне молоко не найкраща Їжа, але все ж таки ти можеш продовжувати.")
        print("Саме найраще це було зїсти кашу, але вже що маємо то маємо, через те що ти зробив не ідеальний вибір в тебе буде мало варіантів продовження. ")
        print("Лягти спати - 1.")
        print("Подумати про таблетку - 2.")
        t2 = input("Тебе болить живіт вибири наступну цифру:")
        t2 = int(t2)
        if t2 == 1:
            print("Ти вибрав варіант поспати, ти ляг спати і під час сну тобі стало дуже погано, твій перший день пройшов погано! Ти програв!  ")
            exit()
        elif t2 == 2:
            print("Ти подумав про таблетку, а як ти уже знаєш твій власник читає думки, він дав тобі таблетку і ти пішов спати, так це не ідеальний кінець дня, з задачою ти справився не дуже, але для першого дня я тобі зарахую як виграш!")
            exit()
    elif eat == 3: # моментальний програш
        print("О ні... Що ти накоїв ти попробув покінчити із своїм власником,але твоїх сил було не достатньо і тебе віддали в приют для собак, твоя гра закінчина...")
        exit()
    else:
        print("Ти порушив правила гри, твоя гра закінчина! Надаль будь уважнішим... Попробуй почати спочатку.")
        exit()
    

    
